using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel;

namespace CommonHelperEntity
{
    /// <summary>
    /// 
    /// </summary>
    public class PublicDatabase
    {
        /// <summary>
        /// 基本姓氏
        /// </summary>
        public const string PublicFamilyNameDatabase = "李|王|张|刘|陈|杨|黄|赵|吴|周|徐|孙|马|朱|胡|郭|何|高|林|罗|郑|梁|谢|宋|唐|许|韩|冯|邓|曹|彭|曾|萧|田|董|潘|袁|于|蒋|蔡|余|杜|叶|程|苏|魏|吕|丁|任|沈|姚|卢|姜|崔|钟|谭|陆|汪|范|金|石|廖|贾|夏|韦|傅|方|白|邹|孟|熊|秦|邱|江|尹|薛|阎|段|雷|侯|龙|史|陶|黎|贺|顾|毛|郝|龚|邵|万|钱|严|覃|河|戴|莫|孔|向|汤";
        /// <summary>
        /// 常用女生名
        /// </summary>
        public const string PublicGrilName = "梦琪|忆柳|之桃|慕青|问兰|尔岚|元香|初夏|沛菡|傲珊|曼文|乐菱|痴珊|恨玉|惜文|香寒|新柔|语蓉|海安|夜蓉|涵柏|水桃|醉蓝|春儿|语琴|从彤|傲晴|语兰|又菱|碧彤|元霜|怜梦|紫寒|妙彤|曼易|南莲|紫翠|雨寒|易烟|如萱|若南|寻真|晓亦|向珊|慕灵|以蕊|寻雁|映易|雪柳|孤岚|笑霜|海云|凝天|沛珊|寒云|冰旋|宛儿|绿真|盼儿|晓霜|碧凡|夏菡|曼香|若烟|半梦|雅绿|冰蓝|灵槐|平安|书翠|翠风|香巧|代云|梦曼|幼翠|友巧|听寒|梦柏|醉易|访旋|亦玉|凌萱|访卉|怀亦|笑蓝|春翠|靖柏|夜蕾|冰夏|梦松|书雪|乐枫|念薇|靖雁|寻春|恨山|从寒|忆香|觅波|静曼|凡旋|以亦|念露|芷蕾|千兰|新波|代真|新蕾|雁玉|冷卉|紫山|千琴|恨天|傲芙|盼山|怀蝶|冰兰|山柏|翠萱|恨松|问旋|从南|白易|问筠|如霜|半芹|丹珍|冰彤|亦寒|寒雁|怜云|寻文|乐丹|翠柔|谷山|之瑶|冰露|尔珍|谷雪|乐萱|涵菡|海莲|傲蕾|青槐|冬儿|易梦|惜雪|宛海|之柔|夏青|亦瑶|妙菡|春竹|痴梦|紫蓝|晓巧|幻柏|元风|冰枫|访蕊|南春|芷蕊|凡蕾|凡柔|安蕾|天荷|含玉|书兰|雅琴|书瑶|春雁|从安|夏槐|念芹|怀萍|代曼|幻珊|谷丝|秋翠|白晴|海露|代荷|含玉|书蕾|听白|访琴|灵雁|秋春|雪青|乐瑶|含烟|涵双|平蝶|雅蕊|傲之|灵薇|绿春|含蕾|从梦|从蓉|初丹|听兰|听蓉|语芙|夏彤|凌瑶|忆翠|幻灵|怜菡|紫南|依珊|妙竹|访烟|怜蕾|映寒|友绿|冰萍|惜霜|凌香|芷蕾|雁卉|迎梦|元柏|代萱|紫真|千青|凌寒|紫安|寒安|怀蕊|秋荷|涵雁|以山|凡梅|盼曼|翠彤|谷冬|新巧|冷安|千萍|冰烟|雅阳|友绿|南松|诗云|飞风|寄灵|书芹|幼蓉|以蓝|笑寒|忆寒|秋烟|芷巧|水香|映之|醉波|幻莲|夜山|芷卉|向彤|小玉|幼南|凡梦|尔曼|念波|迎松|青寒|笑天|涵蕾|碧菡|映秋|盼烟|忆山|以寒|寒香|小凡|代亦|梦露|映波|友蕊|寄凡|怜蕾|雁枫|水绿|曼荷|笑珊|寒珊|谷南|慕儿|夏岚|友儿|小萱|紫青|妙菱|冬寒|曼柔|语蝶|青筠|夜安|觅海|问安|晓槐|雅山|访云|翠容|寒凡|晓绿|以菱|冬云|含玉|访枫|含卉|夜白|冷安|灵竹|醉薇|元珊|幻波|盼夏|元瑶|迎曼|水云|访琴|谷波|乐之|笑白|之山|妙海|紫霜|平夏|凌旋|孤丝|怜寒|向萍|凡松|青丝|翠安|如天|凌雪|绮菱|代云|南莲|寻南|春文|香薇|冬灵|凌珍|采绿|天春|沛文|紫槐|幻柏|采文|春梅|雪旋|盼海|映梦|安雁|映容|凝阳|访风|天亦|平绿|盼香|觅风|小霜|雪萍|半雪|山柳|谷雪|靖易|白薇|梦菡|飞绿|如波|又晴|友易|香菱|冬亦|问雁|妙春|海冬|半安|平春|幼柏|秋灵|凝芙|念烟|白山|从灵|尔芙|迎蓉|念寒|翠绿|翠芙|靖儿|妙柏|千凝|小珍|天巧|妙旋|雪枫|夏菡|元绿|痴灵|绮琴|雨双|听枫|觅荷|凡之|晓凡|雅彤|香薇|孤风|从安|绮彤|之玉|雨珍|幻丝|代梅|香波|青亦|元菱|海瑶|飞槐|听露|梦岚|幻竹|新冬|盼翠|谷云|忆霜|水瑶|慕晴|秋双|雨真|觅珍|丹雪|从阳|元枫|痴香|思天|如松|妙晴|谷秋|妙松|晓夏|香柏|巧绿|宛筠|碧琴|盼兰|小夏|安容|青曼|千儿|香春|寻双|涵瑶|冷梅|秋柔|思菱|醉波|醉柳|以寒|迎夏|向雪|香莲|以丹|依凝|如柏|雁菱|凝竹|宛白|初柔|南蕾|书萱|梦槐|香芹|南琴|绿海|沛儿|晓瑶|听春|凝蝶|紫雪|念双|念真|曼寒|凡霜|飞雪|雪兰|雅霜|从蓉|冷雪|靖巧|翠丝|觅翠|凡白|乐蓉|迎波|丹烟|梦旋|书双|念桃|夜天|海桃|青香|恨风|安筠|觅柔|初南|秋蝶|千易|安露|诗蕊|山雁|友菱|香露|晓兰|白卉|语山|冷珍|秋翠|夏柳|如之|忆南|书易|翠桃|寄瑶|如曼|问柳|香梅|幻桃|又菡|春绿|醉蝶|亦绿|诗珊|听芹|新之|易巧|念云|晓灵|静枫|夏蓉|如南|幼丝|秋白|冰安|秋白|南风|醉山|初彤|凝海|紫文|凌晴|香卉|雅琴|傲安|傲之|初蝶|寻桃|代芹|诗霜|春柏|绿夏|碧灵|诗柳|夏柳|采白|慕梅|乐安|冬菱|紫安|宛凝|雨雪|易真|安荷|静竹|代柔|丹秋|绮梅|依白|凝荷|幼珊|忆彤|凌青|之桃|芷荷|听荷|代玉|念珍|梦菲|夜春|千秋|白秋|谷菱|飞松|初瑶|惜灵|恨瑶|梦易|新瑶|曼梅|碧曼|友瑶|雨兰|夜柳|香蝶|盼巧|芷珍|香卉|含芙|夜云|依萱|凝雁|以莲|易容|元柳|安南|幼晴|尔琴|飞阳|白凡|沛萍|雪瑶|向卉|采文|乐珍|寒荷|觅双|白桃|安卉|迎曼|盼雁|乐松|涵山|恨寒|问枫|以柳|含海|秋春|翠曼|忆梅|涵柳|梦香|海蓝|晓曼|代珊|春冬|恨荷|忆丹|静芙|绮兰|梦安|紫丝|千雁|凝珍|香萱|梦容|冷雁|飞柏|天真|翠琴|寄真|秋荷|代珊|初雪|雅柏|怜容|如风|南露|紫易|冰凡|海雪|语蓉|碧玉|翠岚|语风|盼丹|痴旋|凝梦|从雪|白枫|傲云|白梅|念露|慕凝|雅柔|盼柳|半青|从霜|怀柔|怜晴|夜蓉|代双|以南|若菱|芷文|寄春|南晴|恨之|梦寒|初翠|灵波|巧春|问夏|凌春|惜海|亦旋|沛芹|幼萱|白凝|初露|迎海|绮玉|凌香|寻芹|秋柳|尔白|映真|含雁|寒松|友珊|寻雪|忆柏|秋柏|巧风|恨蝶|青烟|问蕊|灵阳|春枫|又儿|雪巧|丹萱|凡双|孤萍|紫菱|寻凝|傲柏|傲儿|友容|灵枫|尔丝|曼凝|若蕊|问丝|思枫|水卉|问梅|念寒|诗双|翠霜|夜香|寒蕾|凡阳|冷玉|平彤|语薇|幻珊|紫夏|凌波|芷蝶|丹南|之双|凡波|思雁|白莲|从菡|如容|采柳|沛岚|惜儿|夜玉|水儿|半凡|语海|听莲|幻枫|念柏|冰珍|思山|凝蕊|天玉|问香|思萱|向梦|笑南|夏旋|之槐|元灵|以彤|采萱|巧曼|绿兰|平蓝|问萍|绿蓉|靖柏|迎蕾|碧曼|思卉|白柏|妙菡|怜阳|雨柏|雁菡|梦之|又莲|乐荷|寒天|凝琴|书南|映天|白梦|初瑶|恨竹|平露|含巧|慕蕊|半莲|醉卉|天菱|青雪|雅旋|巧荷|飞丹|恨云|若灵|问萍|青蕾|雁云|芷枫|千旋|向梅|含蓝|怀丝|梦文|幼芙|晓云|雨旋|秋安|雁风|碧槐|从海|语雪|幼凡|秋卉|曼蕾|问蕾|访兰|寄莲|紫绿|新雁|恨容|水柳|南云|曼阳|幼蓝|忆巧|灵荷|怜兰|听曼|碧双|忆雁|夜松|映莲|听曼|秋易|绿莲|宛秋|雁安|问旋|以蓝|若亦|幻丝|山凡|南云|寄蕊|绿春|思海|寄天|友秋|紫玉|从筠|雪海|白筠|灵芙|安莲|惜梅|雪蕾|寄容|秋波|冷云|秋儿|怀菱|亦柏|易槐|怀卉|紫桃|向蕊|易青|千蕊|怜露|灵旋|怀梅|天柏|半白|碧安|秋枫|傲丝|春柔|冰岚|雅翠|易白|夜灵|静柔|醉绿|乐蕊|寄蓝|乐彤|迎琴|之亦|雨寒|谷山|凝安|曼萍|碧露|书南|山薇|念珊|芷雁|尔蕾|绮雪|傲萱|新琴|绿蝶|慕旋|怀易|傲云|晓梅|诗菱|灵珊|幻香|若云|如霜|晓晴|灵山|恨桃|梦凝|幻彤|觅波|慕玉|念山|乐桃|语寒|怀海|孤蝶|灵凝|慕蓝|紫青|千兰|孤柔|语曼|问海|寄筠|安露|听晴|冷寒|之翠|碧灵|凡丝|诗波|友芙|寄莲|之蕊|海琴|宛筠|半山|依槐|觅曼|碧菱|半文|访儿|芷珍|绿春|春蝶|怜槐|映露|雨卉|灵亦|惜莲|念菡|南凡|曼桃|笑灵|惜安|凌筠|翠菡|寒雁|以山|秋彤|巧兰|山雪|寒绿|忆易|依萱|如菡|含萱|惜梦|绮莲|翠易|冷筠|乐槐|傲青|幼灵|春柔|恨易|青文|初竹|从旋|沛山|映凝|静柳|雪云|醉蕊|巧荷|思蓝|翠秋| 初双|雪旋|从霜|静萍|之彤|晓筠|含云|思兰|梦之|醉芙|若曼|寻槐|夜梅|访安|以绿|新柏|诗珊|灵青|幻菱|谷双|梦烟|凡烟|寻绿|香之|盼蕊|香筠|怀萱|半蓉|翠安|忆卉|念柏|念之|宛彤|如竹|天雪|念旋|笑萍|海风|小琴|乐海|易南|碧蕊|雁凝|雁风|依霜|天蝶|语凝|之卉|易云|若菡|幼兰|巧曼|以柳|小天|采雁|易莲|笑南|芷雁|觅霜|海柏|凝雪|诗晴|以梅|绮荷|乐山|又梦|听蓝|又彤|向竹|安琴|秋露|如波|尔槐|小易|静云|梦雪|幼凝|慕莲|如薇|静秋|幼柏|谷易|安芙|觅琴|冰槐|诗青|碧秋|从琴|从梦|寻风|凡薇|夜云|幼芙|以彤|怀云|幻柳|芷秋|以菱|靖柳|紫松|凡霜|灵云|采芙|亦露|香风|觅蓉|雨槐|又雪|碧蕾|香松|以亦|芷柔|千曼|友山|惜晴|幼文|寒波|友岚|乐槐|盼蝶|思山|以天|念梦|白桃|映翠|雁柳|翠灵|以竹|听雁|梦丝|冷烟|山露|安易|静霜|天珊|念蓝|书容|半晴|笑薇|孤萱|寄梦|秋蕊|从蝶|晓曼|半槐|绮易|访岚|含丝|慕安|怀雁|傲露|天岚|安寒|寻雪|幻旋|雁彤|天玉|亦珊|迎荷|慕柏|书柳|春海|初柏|绮翠|凝珍|海芙|尔香|问旋|紫之|灵翠|芷波|曼梦|向蕊|笑琴|映丝|妙筠|紫彤|妙曼|以阳|紫筠|易玉|梦蓝|谷露|曼春|寻枫|寻山|慕槐|凝绿|凝梅|醉文|听雪|以珊|友柳|孤珊|山芙|向凡|如巧|从彤|南翠|天凝";
        public const string PublicBoyName = "晨铭|锦航|奕然|嘉彦|天瑞|梓原|谨丞|易天|溢昕|锦程|海晔|浩浚|书宇|柏达|贻贤|皓淇|嘉杰|子錾|聪希|俊嘉|威源|俊秋|子博|梓豪|祺韬|昕然|壮淳|成文|思众|康雯|卓琦|宇龙|德霖|潇泽|昱铭|菁迪|渊浩|潇天|浩宾|祥博|仁潇|瀚予|思亮|屹城|宏蒙|潇茗|泽瑞|欣怡|源洧|玉轩|星宇|德楚|奕楷|涵涵|春华|冬铭|嘉彧|屹锋|彦霖|祉瑜|加睿|智瑜|柏茂|衡骏|沛鑫|杰棠|浩善|宁启|乐正|昕睿|瞻逞|景杰|颖浩|锴轩|威泽|雯宝|和正|志俊|哲铭|文睿|晨润|德润|皓睿|嘉南|润萱|知轩|致宜|柏晗|适铭|泽霏|鑫祺|佑宏|修远|惠卓|靖越|灏然|向笛|禹泽|炫传|元宇|柏祺|洺僮|育博|明敬|俊德|楚文|天霖|宾鸿|俊驰|佳峰|紫潇|梓坤|汶銮|永望|程皓|希喜|筠涵|祉鑫|禹浩|凯若|正涛|楚洋|若实|贻楚|宏才|泓辛|昊然|泰鸿|祥容|博凯|滨宸|钧心|子淼|然耀|文哲|南栋|瑞柯|俊辰|予正|彦泽|梓轩|丞聪|永瑞|炫宇|灏铭|敏晖|月羲|承承|文晨|斯辰|芝瑞|康文|祺铭|璟良|世雅|和雅|裕添|明坤|然旭|乐语|楚恒|令凯|睿浩|仕哲|泽欣|奇年|传铮|明岳|昱灿|江熙|龙玉|卓宇|梓骆|炜涛|金锦|一维|海佳|健杰|元皓|嘉勋|随矾|航连|洪可|雄岚|特诚|晴森|琼辉|饶瀚|祟召|凯珺|祟年|丹潇|朔示|曦趣|友耀|潇增|岚量|峰瑜|饶郡|捷涵|腾方|迪丹|匀耀|尧匀|顺钧|特赫|原嘉|洋至|城石|铧锐|巍津|登策|泷仁|续特|瀚啸|展慈|备舜|澜怀|蓝磊|雄元|家功|捷及|清然|记铭|轩召|刚豪|力赫|宬州|誉继|峰丞|瀚万|策匀|倡名|跃恺|航与|钧丹|祟名|淇方|备琅|理博|舜仁|轩史|原荣|恒丞|越焱|越晴|家功|珂纲|展充|洪正|继剑|玹以|登理|钦铄|超匀|杰及|潇慕|量鹰|记仰|栋茗|富钦|为胜|家巧|钊与|雄景|航弛|祟豪|续华|丹矾|玹至|根语|严谆|笑代|倬石|琅超|续溥|根维|伦石|颢恩|盛及|晗昱|晗日|涵畅|涵涤|涵亮|涵忍|涵容|涵润|涵涵|涵煦|涵蓄|涵衍|昊焱|昊英|浩波|浩博|浩初|浩大|浩宕|浩荡|浩歌|浩广|浩涆|浩瀚|瀚玥|翰藻|瀚海|瀚漠|昊苍|昊昊|昊空|昊乾|昊穹|昊然|昊然|昊天|云帆|方宁|明惟|庆详|万军|清泉|亦罗|胤历|谢君|嘉玮|帅明|秋宇|驭轩|子含|訾劾|成秀|艳君|耀耀|玉抒|浩瑞|小轩|志波|煜景|格峰|天哲|茂溪|馨蔓|诵旭|丰源|微云|为民|祥熙|忆轩|俊屹|营宝|姝妤|思聪|昕瞳|奕杉|孟绅|正光|振武|恩仪|永峻|文京|逸然|国诚|龙淼|顺耀|泽伟|明荣|佳乐|晓晴|齐天|希宗|泣涵|和峰|松南|是羽|弘渝|锐泽|锐阵|锐志|锐智|睿博|睿才|睿诚|睿慈|睿聪|睿达|睿德|睿范|鹏飞|鹏赋|鹏海|鹏鲸|鹏举|鹏鹍|鹏鲲|鹏涛|鹏天|鹏翼|鹏云|鹏运|力言|立诚|立果|立人|立辉|立轩|立群|良奥|良弼|良才|良材|良策|凯捷|凯凯|凯康|凯乐|凯旋|凯泽|恺歌|恺乐|康安|康伯|康成|康德|骏民|骏年|骏奇|骏伟|骏祥|骏雄|骏泽|骏哲|骏喆|骞骞|子骞|绍骞|俊采|翔宇|泞鹪|庆昌|顺香|梦暄|欣逸|晓坤|广应|其运|淇兴|镜桦|建弼|建德|建华|建明|建茗|建木|建树|建同|建修|建业|建义|建元|嘉赐|嘉德|嘉福|嘉良|嘉茂|嘉木|嘉慕|嘉纳|嘉年|嘉平|嘉庆|嘉荣|季恒|书帛|炀霏|龙斌|玉华|卉霖|玮宏|永明|宇浩|续豪|誉玮|培杰|鸿志|鸿卓|华奥|华采|华彩|华灿|华藏|华池|华翰|华皓|华晖|华辉|鸿信|鸿轩|鸿煊|鸿煊|鸿雪|鸿羽|鸿远|鸿云|鸿运|鸿哲|鸿祯|鸿振|鸿达|鸿德|鸿飞|鸿风|鸿福|鸿光|鸿晖|鸿朗|鸿文|鸿熙|鸿羲|鸿禧|浩浩|浩慨|浩旷|浩阔|浩漫|浩淼|浩渺|浩邈|浩气|浩然|浩穰|浩壤|涵意|涵映|涵育|翰采|翰池|翰飞|翰海|翰翮|翰林|翰墨|翰学|翰音|刚豪|刚洁|刚捷|刚毅|德友|英智|双庆|子辰|佳龙|靖心|炜航|玉平|江华|兴友|嘉锦|毓徽|成宏|欣鑫|天宇|一帆|钦泽|鑫嫒|又铭|恒伟|鹭洋|勇清|霈泽|遥来|辰骏|驰海|驰皓|驰文|驰轩|飞驰|家骏|骞北|骏琛|骏德|骏桀|骏俊|宾盟|锡明|琰沣|恒铭|钧涵|佳宇|梓言|志勇|家乐|若木|启波|久宣|宝林|世吉|永祺|奕心|培致|修为|山东|国邑|春蕴|广博|春刚|宏阳|";
        /// <summary>
        /// 随机生成姓
        /// </summary>
        /// <returns>产生的姓氏</returns>
        public static string CreatGuidFamilyName(string[] falimyNames) 
        {//确保生成真实的随机数
            int seed= Guid.NewGuid().GetHashCode();
            Random random = new Random(seed);
            DateTime now = DateTime.Now;
           
            int index = random.Next(0, falimyNames.Length);
            return falimyNames[index];
        }
        static Guid guid { get; set; }
    }
}
